{
  "kind": "build_request",
  "title": "Add persistent bottom-right image frame after Yes + play uploaded “forever” song as background music",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "After the user clicks the “Yes” button in frontend/index.html, display the uploaded image (IMG_20221213_093702.jpg) in a small persistent frame fixed to the bottom-right corner of the screen. The frame must remain visible for the rest of the session (no auto-dismiss). The image display must be separate from (not inside) the existing buttons/messages area.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "at the end can u make this image popup in a small frame when she presses yes",
          "bottom right corner",
          "stay on the screen",
          "separate space"
        ]
      },
      "acceptanceCriteria": [
        "Before “Yes” is clicked, no bottom-right image frame is visible.",
        "Immediately after clicking “Yes”, a small frame appears at the bottom-right containing IMG_20221213_093702.jpg.",
        "The frame remains visible until the page is reloaded (no timer-based dismissal).",
        "The image frame is not rendered inside the main card’s button/message container; it is positioned independently (fixed bottom-right).",
        "On mobile and desktop, the frame stays within the viewport (respects safe-area insets if applicable) and does not block the “Yes” click interaction."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add background music playback in frontend/index.html using the previously uploaded “forever” song file from this chat. Music must start only after explicit user interaction (use the existing tap-to-start / intro interaction) and then play as background music while the page is open.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "and the forever song i uploaded day before yesteraday in this chat should also be there as background music"
        ]
      },
      "acceptanceCriteria": [
        "Background music does not attempt to autoplay on page load (no browser autoplay violations).",
        "After the user completes the first explicit interaction that starts the experience (intro/tap-to-start), the “forever” song begins playing as background music.",
        "If the “forever” audio asset cannot be loaded for any reason, the page continues to function without crashing (graceful failure)."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/components/ui or any other paths listed as immutable in SYSTEM_CONTEXT.",
    "Keep the experience working as a static site (no backend dependency required for image/music playback).",
    "All user-facing text introduced by these changes must be in English."
  ],
  "nonGoals": [
    "Adding new UI flows, extra buttons (e.g., close image, mute/unmute), or changing the existing Valentine proposal storyline beyond the requested image frame and background music.",
    "Backend canister changes (Motoko) are out of scope unless strictly required for static asset delivery (not expected)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}