{
  "kind": "build_request",
  "title": "Fix No button evasion so it never disappears and completes all 7 evasions",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-21",
      "text": "Fix the “No” button evasion positioning logic in `frontend/index.html` so the No button never moves outside the visible viewport safe area (i.e., it remains fully visible and clickable/tappable at all times), preventing it from disappearing after ~2 evasions.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-1"
        ],
        "quotes": [
          "bro idiot just fix the no button which comes only 2 times and afyter that i cant find the no button its ouut of its rendering area"
        ]
      },
      "acceptanceCriteria": [
        "On desktop, repeatedly triggering No-button evasion (hover/click) never results in the No button being partially or fully off-screen.",
        "On mobile, repeatedly triggering No-button evasion (tap/touch) never results in the No button being partially or fully off-screen.",
        "After each evade, the No button remains reachable (not covered by other UI, not positioned outside the visible area, and still responds to the next interaction)."
      ]
    },
    {
      "id": "REQ-22",
      "text": "Ensure the proposal flow continues correctly after the positioning fix: the No button reliably performs 7 successful evasions and only then reveals the Yes button, with behavior consistent across desktop and mobile.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-2"
        ],
        "quotes": [
          "see the no button should evade 7 times but if the no button isnt available then how will the process continue"
        ]
      },
      "acceptanceCriteria": [
        "The No button successfully evades at least 7 times in a row without becoming unresponsive or disappearing.",
        "The Yes button does not appear before the 7th successful evade.",
        "The Yes button appears reliably immediately after the 7th successful evade on both desktop and mobile."
      ]
    }
  ],
  "constraints": [
    "Implement the fix within the existing single-page implementation in `frontend/index.html` (no new backend dependencies).",
    "Do not edit any frontend files listed as immutable in SYSTEM_CONTEXT.",
    "Keep all user-facing text in English."
  ],
  "nonGoals": [
    "Adding new features unrelated to No-button evasion (e.g., new animations, new admin features, new audio tracks).",
    "Backend (Motoko) changes or persistence/schema changes."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}