{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Keep No button always in-viewport and complete 7 evasions reliably",
  "requirements": [
    {
      "id": "REQ-21",
      "summary": "Clamp No-button evasion positions to the visible viewport safe area so it never goes off-screen on desktop or mobile.",
      "acceptanceCriteria": [
        "On desktop, repeatedly triggering No-button evasion (hover/click) never results in the No button being partially or fully off-screen.",
        "On mobile, repeatedly triggering No-button evasion (tap/touch) never results in the No button being partially or fully off-screen.",
        "After each evade, the No button remains reachable (not covered by other UI, not positioned outside the visible area, and still responds to the next interaction)."
      ],
      "file_operations": [
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Update the No button evasion positioning logic to compute a safe in-viewport position every time: measure the No button size, use the current visible viewport bounds (accounting for mobile visual viewport when available), apply a consistent padding margin, and clamp the target X/Y so the entire button stays fully visible. Also ensure resize/orientation changes re-validate/re-clamp the current No button position so it cannot become off-screen after layout changes."
        }
      ]
    },
    {
      "id": "REQ-22",
      "summary": "Make the proposal flow deterministic: exactly 7 successful No-button evasions, then reveal the Yes button consistently on desktop and mobile.",
      "acceptanceCriteria": [
        "The No button successfully evades at least 7 times in a row without becoming unresponsive or disappearing.",
        "The Yes button does not appear before the 7th successful evade.",
        "The Yes button appears reliably immediately after the 7th successful evade on both desktop and mobile."
      ],
      "file_operations": [
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Harden the evasion counter and interaction handling so each user attempt triggers at most one evade increment (avoid double-counting from overlapping mouse/touch/pointer events). Ensure the No button remains interactive through 7 evasions by using a single unified interaction handler (pointer/mouse/touch as appropriate) that always calls the clamped reposition routine and updates the message. After the 7th successful evade, stop further evasion, keep the No button from interfering, and reveal the Yes button immediately (and only then), with the same behavior across desktop and mobile."
        }
      ]
    }
  ]
}