{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Persistent bottom-right photo frame after Yes + background music on intro interaction",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Show a small persistent bottom-right image frame (IMG_20221213_093702.jpg) after “Yes” is clicked, separate from the main card/button area.",
      "acceptanceCriteria": [
        "Before “Yes” is clicked, no bottom-right image frame is visible.",
        "Immediately after clicking “Yes”, a small frame appears at the bottom-right containing IMG_20221213_093702.jpg.",
        "The frame remains visible until the page is reloaded (no timer-based dismissal).",
        "The image frame is not rendered inside the main card’s button/message container; it is positioned independently (fixed bottom-right).",
        "On mobile and desktop, the frame stays within the viewport (respects safe-area insets if applicable) and does not block the “Yes” click interaction."
      ],
      "file_operations": [
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Add a dedicated, initially-hidden DOM container for the bottom-right image frame outside the main card, plus CSS for a fixed bottom-right layout that respects safe-area insets and uses pointer-events settings so it won’t block the “Yes” click. Update the existing “Yes” click handler to reveal the frame and keep it visible for the session."
        },
        {
          "path": "frontend/assets/IMG_20221213_093702.jpg",
          "operation": "create",
          "description": "Add the provided image asset to the static site so frontend/index.html can reference it via a stable relative path (no backend dependency)."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Play the uploaded “forever” song as background music starting only after the first explicit user interaction (intro/tap-to-start), and keep playing while the page is open.",
      "acceptanceCriteria": [
        "Background music does not attempt to autoplay on page load (no browser autoplay violations).",
        "After the user completes the first explicit interaction that starts the experience (intro/tap-to-start), the “forever” song begins playing as background music.",
        "If the “forever” audio asset cannot be loaded for any reason, the page continues to function without crashing (graceful failure)."
      ],
      "file_operations": [
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Add an <audio> element (or programmatic Audio instance) configured for looping background playback and wire it to the existing intro/tap-to-start interaction so playback begins only after that user gesture. Ensure playback failures (e.g., load/play promise rejection) are caught and do not break the page flow."
        },
        {
          "path": "frontend/assets/forever.mp3",
          "operation": "create",
          "description": "Add the provided “forever” audio asset to the static site so frontend/index.html can load it locally without backend dependencies."
        }
      ]
    }
  ]
}